000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыДляОбработки/ОбъектыДляОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыДляОбработки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>IDN</name>
    <comment>Идентификатор объекта в Navision (или другая информация)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействиеКоманда</name>
    <comment>Задается литерально для облегчения использования в коде</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объект</name>
    <comment>Некторый объект</comment>
    <type>
      <types>Date</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </resources>
  <resources>
    <name>Хранилище</name>
    <comment>Любая другая дополнительная информация, назначенная для обработки командой</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <comment>Пустой - по всем магазинам</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <comment>Во избежание случайных совпадений</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыДляОбработки/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


КонецПроцедуры
	
#КонецОбласти

&НаСервере
Процедура ПоказатьВремяСозданияСсылкиНаСервере()

	Если ЗначениеЗаполнено(Запись.Объект) Тогда

		ТекстДобавить = ОбщегоНазначенияКлиентСервер.УникальныйИдентификаторВремя(Запись.Объект.УникальныйИдентификатор());

	Иначе

		ТекстДобавить = "Ссылка не указана.";

	КонецЕсли;

	ТекстоваяИнформация = ТекстоваяИнформация + ?(ПустаяСтрока(ТекстоваяИнформация), "", Символы.ПС) + ТекстДобавить;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВремяСозданияСсылки(Команда)

	ПоказатьВремяСозданияСсылкиНаСервере();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказатьКонтентХранилищаНаСервере(Период, Магазин, Индекс, ТекстоваяИнформация)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Хранилище КАК Хранилище
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбработки КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период = &Период
	|	И ТаблицаРегистра.Магазин = &Магазин
	|	И ТаблицаРегистра.Индекс = &Индекс"
	);
	Запрос.УстановитьПараметр("Период" , Период);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("Индекс" , Индекс);
	
	Показано = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда

		ДанныеХранилища = Выборка.Хранилище.Получить();

		Если ТипЗнч(ДанныеХранилища) = Тип("Строка") И НЕ ПустаяСтрока(ДанныеХранилища) Тогда

			ТекстоваяИнформация = ТекстоваяИнформация + ?(ПустаяСтрока(ТекстоваяИнформация), "", Символы.ПС) + СокрЛП(ДанныеХранилища);
			Показано = Истина;

		КонецЕсли;

	КонецЕсли;
	
	Возврат Показано;

КонецФункции

&НаКлиенте
Процедура ПоказатьКонтентХранилища(Команда)

	Если НЕ ПоказатьКонтентХранилищаНаСервере(Запись.Период, Запись.Магазин, Запись.Индекс, ТекстоваяИнформация) Тогда

		ПоказатьОповещениеПользователя(
			"Данные хранилища недоступны",
			ПолучитьНавигационнуюСсылку(Запись.Объект),
			"Нет возможности отобразить данные хранилища в текстовом формате",
			БиблиотекаКартинок.Информация32
		);

	КонецЕсли;

КонецПроцедуры
